app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items"

  def create
    @item = Item.new(params[:item])
    @user = User.find_by_UID(params[:user])
    @item.user = @user

    if @item.save
---
SELECT "users".* FROM "users" WHERE "users"."UID" = 'sdysg' LIMIT 1
INSERT INTO "items" ("category", "created_at", "description", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category", nil], ["created_at", Sat, 28 Sep 2013 12:54:20 UTC +00:00], ["description", "blablabla"], ["status", nil], ["updated_at", Sat, 28 Sep 2013 12:54:20 UTC +00:00], ["user_id", 1]]