app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."status" = 'open'
---
  def index
    filter = params[:filter].downcase.to_sym

    case filter
    when :all
      @items = Item.all
    when :open
      @items = Item.where(status: "open")