app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review: params[:review])
    @user = User.find_by_UID(params[:user])
    task = Task.find(params[:task])
    @review.user = @user
    @review.task = task

    if @review.save
---
SELECT "users".* FROM "users" WHERE "users"."UID" = 'sdysg' LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("created_at", "outcome", "task_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 28 Sep 2013 12:53:55 UTC +00:00], ["outcome", "blablabla"], ["task_id", nil], ["updated_at", Sat, 28 Sep 2013 12:53:55 UTC +00:00], ["user_id", 1]]
UPDATE "tasks" SET "status" = 'done', "updated_at" = '2013-09-29 08:59:05.194943' WHERE "tasks"."id" = 1