app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = 'done'
---
  def index
    filter = params[:filter].downcase.to_sym if params[:filter]

    case filter
    when :all
      @tasks = Task.all
    when :open
      @tasks = Task.where(status: "open")

SELECT "users".* FROM "users" WHERE "users"."UID" = 'sdysg' LIMIT 1
INSERT INTO "tasks" ("created_at", "description", "due_date", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 28 Sep 2013 12:53:22 UTC +00:00], ["description", "blablabla"], ["due_date", nil], ["status", nil], ["updated_at", Sat, 28 Sep 2013 12:53:22 UTC +00:00], ["user_id", 1]]
---
  def create
    @task = Task.new(task: params[:task])
    user = User.order("RANDOM()").first
    @task.user = user

    if @task.save!