app/controllers/users_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "groups" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 28 Sep 2013 12:43:16 UTC +00:00], ["updated_at", Sat, 28 Sep 2013 12:43:16 UTC +00:00]]
INSERT INTO "users" ("UID", "created_at", "group_id", "name", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["UID", "sdysg"], ["created_at", Sat, 28 Sep 2013 12:37:35 UTC +00:00], ["group_id", nil], ["name", "test"], ["surname", "bla"], ["updated_at", Sat, 28 Sep 2013 12:37:35 UTC +00:00]]
---
  def create
    if params[:group]
      group = Group.find(params[:group])
    else
      group = Group.new
    end
    @user = User.new(user: params[:user])
    @user.group = group

    if @user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "group_id" = 1, "updated_at" = '2013-09-28 13:14:54.701167' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    if params[:group]
      @user.group = Group.find(params[:group])
      @user.save!